tests/Cases/Case-sprayClouds/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.1;
//5d
L 1;
mL -1;
//20d
H 1;

vertices
(
// BASE
// front left
    ($mL  $mL  0 ) //0

// front right
    ( $L  $mL  0 ) //1
    
// back right
    ( $L   $L  0 ) //2
    
// back left
    ($mL   $L  0 ) //3

// TOP
// front left
    ($mL  $mL  $H) //4

// front right
    ( $L  $mL  $H) //5
    
// back right
    ( $L   $L  $H) //6
    
// back left
    ($mL   $L  $H) //7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 25) simpleGrading (1 1 1) //PP
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        physicalType particleOutflow;
        faces
        (
            (4 5 6 7)
        );
    }
    
    side
    {
        type patch;
        physicalType particleOutflow;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
    
    inletCoflow
    {
        type patch;
        physicalType noParticleOutflow;
        faces
        (
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
